#### Terraform Plan for Dev Environment 📋

```
Acquiring state lock. This may take a few moments...
[0m[1mmodule.utility_layer.data.archive_file.layer_zip: Reading...[0m[0m
[0m[1mmodule.dependencies_layer.data.archive_file.layer_zip: Reading...[0m[0m
[0m[1mmodule.post_xyz_lambda.data.archive_file.lambda_zip: Reading...[0m[0m
[0m[1mmodule.get_xyz_lambda.data.archive_file.lambda_zip: Reading...[0m[0m
[0m[1mmodule.utility_layer.data.archive_file.layer_zip: Read complete after 0s [id=0a188f87be146132927346567b1f7934c25c3dc2][0m
[0m[1mmodule.post_xyz_lambda.data.archive_file.lambda_zip: Read complete after 0s [id=155fd2585cbc28f2a502b448e449ee2fb407d0ef][0m
[0m[1mmodule.get_xyz_lambda.data.archive_file.lambda_zip: Read complete after 0s [id=7e1ab8e015653f3e3a8af0f2a2641ea1905f6dde][0m
[0m[1mmodule.dependencies_layer.data.archive_file.layer_zip: Read complete after 0s [id=cc8211afb4c9e00de7c8bf34364fb577fb3867d7][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.api_gateway.aws_api_gateway_deployment.this[0m will be created
[0m  [32m+[0m[0m resource "aws_api_gateway_deployment" "this" {
      [32m+[0m[0m created_date  = (known after apply)
      [32m+[0m[0m execution_arn = (known after apply)
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m invoke_url    = (known after apply)
      [32m+[0m[0m rest_api_id   = (known after apply)
    }

[1m  # module.api_gateway.aws_api_gateway_integration.get_xyz[0m will be created
[0m  [32m+[0m[0m resource "aws_api_gateway_integration" "get_xyz" {
      [32m+[0m[0m cache_namespace         = (known after apply)
      [32m+[0m[0m connection_type         = "INTERNET"
      [32m+[0m[0m http_method             = "GET"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m integration_http_method = "POST"
      [32m+[0m[0m passthrough_behavior    = (known after apply)
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m rest_api_id             = (known after apply)
      [32m+[0m[0m timeout_milliseconds    = 29000
      [32m+[0m[0m type                    = "AWS_PROXY"
      [32m+[0m[0m uri                     = (known after apply)
    }

[1m  # module.api_gateway.aws_api_gateway_integration.post_xyz[0m will be created
[0m  [32m+[0m[0m resource "aws_api_gateway_integration" "post_xyz" {
      [32m+[0m[0m cache_namespace         = (known after apply)
      [32m+[0m[0m connection_type         = "INTERNET"
      [32m+[0m[0m http_method             = "POST"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m integration_http_method = "POST"
      [32m+[0m[0m passthrough_behavior    = (known after apply)
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m rest_api_id             = (known after apply)
      [32m+[0m[0m timeout_milliseconds    = 29000
      [32m+[0m[0m type                    = "AWS_PROXY"
      [32m+[0m[0m uri                     = (known after apply)
    }

[1m  # module.api_gateway.aws_api_gateway_method.get_xyz[0m will be created
[0m  [32m+[0m[0m resource "aws_api_gateway_method" "get_xyz" {
      [32m+[0m[0m api_key_required = false
      [32m+[0m[0m authorization    = "NONE"
      [32m+[0m[0m http_method      = "GET"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m resource_id      = (known after apply)
      [32m+[0m[0m rest_api_id      = (known after apply)
    }

[1m  # module.api_gateway.aws_api_gateway_method.post_xyz[0m will be created
[0m  [32m+[0m[0m resource "aws_api_gateway_method" "post_xyz" {
      [32m+[0m[0m api_key_required = false
      [32m+[0m[0m authorization    = "NONE"
      [32m+[0m[0m http_method      = "POST"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m resource_id      = (known after apply)
      [32m+[0m[0m rest_api_id      = (known after apply)
    }

[1m  # module.api_gateway.aws_api_gateway_resource.xyz[0m will be created
[0m  [32m+[0m[0m resource "aws_api_gateway_resource" "xyz" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m parent_id   = (known after apply)
      [32m+[0m[0m path        = (known after apply)
      [32m+[0m[0m path_part   = "xyz"
      [32m+[0m[0m rest_api_id = (known after apply)
    }

[1m  # module.api_gateway.aws_api_gateway_rest_api.this[0m will be created
[0m  [32m+[0m[0m resource "aws_api_gateway_rest_api" "this" {
      [32m+[0m[0m api_key_source               = (known after apply)
      [32m+[0m[0m arn                          = (known after apply)
      [32m+[0m[0m binary_media_types           = (known after apply)
      [32m+[0m[0m created_date                 = (known after apply)
      [32m+[0m[0m description                  = (known after apply)
      [32m+[0m[0m disable_execute_api_endpoint = (known after apply)
      [32m+[0m[0m execution_arn                = (known after apply)
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m minimum_compression_size     = (known after apply)
      [32m+[0m[0m name                         = "efy-web-backend-dev-api"
      [32m+[0m[0m policy                       = (known after apply)
      [32m+[0m[0m root_resource_id             = (known after apply)
      [32m+[0m[0m tags                         = {
          [32m+[0m[0m "CostCenter"  = "development"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "efy-web-backend-dev"
          [32m+[0m[0m "Project"     = "efy-web-backend"
          [32m+[0m[0m "Workspace"   = "dev"
        }
      [32m+[0m[0m tags_all                     = {
          [32m+[0m[0m "CostCenter"  = "development"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "efy-web-backend-dev"
          [32m+[0m[0m "Project"     = "efy-web-backend"
          [32m+[0m[0m "Workspace"   = "dev"
        }
    }

[1m  # module.api_gateway.aws_api_gateway_stage.this[0m will be created
[0m  [32m+[0m[0m resource "aws_api_gateway_stage" "this" {
      [32m+[0m[0m arn           = (known after apply)
      [32m+[0m[0m deployment_id = (known after apply)
      [32m+[0m[0m execution_arn = (known after apply)
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m invoke_url    = (known after apply)
      [32m+[0m[0m rest_api_id   = (known after apply)
      [32m+[0m[0m stage_name    = "default"
      [32m+[0m[0m tags_all      = (known after apply)
      [32m+[0m[0m web_acl_arn   = (known after apply)
    }

[1m  # module.api_gateway.aws_lambda_permission.get_xyz[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "get_xyz" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = "AllowExecutionFromAPIGateway"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # module.api_gateway.aws_lambda_permission.post_xyz[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "post_xyz" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = "AllowExecutionFromAPIGateway"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # module.dependencies_layer.aws_lambda_layer_version.this[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_layer_version" "this" {
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m code_sha256                 = (known after apply)
      [32m+[0m[0m compatible_runtimes         = [
          [32m+[0m[0m "nodejs18.x",
          [32m+[0m[0m "nodejs20.x",
        ]
      [32m+[0m[0m created_date                = (known after apply)
      [32m+[0m[0m description                 = "Shared dependencies for Lambda functions - dev"
      [32m+[0m[0m filename                    = "./builds/efy-web-backend-dev-dependencies-layer.zip"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m layer_arn                   = (known after apply)
      [32m+[0m[0m layer_name                  = "efy-web-backend-dev-dependencies-layer"
      [32m+[0m[0m signing_job_arn             = (known after apply)
      [32m+[0m[0m signing_profile_version_arn = (known after apply)
      [32m+[0m[0m skip_destroy                = false
      [32m+[0m[0m source_code_hash            = "2OrgUTqKaxDfvFqaTvTQiFrZYTHJW9OXTB/ZfqjDxi8="
      [32m+[0m[0m source_code_size            = (known after apply)
      [32m+[0m[0m version                     = (known after apply)
    }

[1m  # module.get_xyz_lambda.aws_iam_role.lambda_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "efy-web-backend-dev-get-xyz-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "CostCenter"  = "development"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "efy-web-backend-dev"
          [32m+[0m[0m "Project"     = "efy-web-backend"
          [32m+[0m[0m "Workspace"   = "dev"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "CostCenter"  = "development"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "efy-web-backend-dev"
          [32m+[0m[0m "Project"     = "efy-web-backend"
          [32m+[0m[0m "Workspace"   = "dev"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.get_xyz_lambda.aws_iam_role_policy_attachment.lambda_basic[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "lambda_basic" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      [32m+[0m[0m role       = "efy-web-backend-dev-get-xyz-role"
    }

[1m  # module.get_xyz_lambda.aws_lambda_function.this[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m filename                       = "./builds/efy-web-backend-dev-get-xyz.zip"
      [32m+[0m[0m function_name                  = "efy-web-backend-dev-get-xyz"
      [32m+[0m[0m handler                        = "index.handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m layers                         = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = false
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "nodejs18.x"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = "9EnRLxPn9tip8r/xLLyW4+uXZ0XvwWiVaBA5hZ9fnXI="
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "CostCenter"  = "development"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "efy-web-backend-dev"
          [32m+[0m[0m "Project"     = "efy-web-backend"
          [32m+[0m[0m "Workspace"   = "dev"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "CostCenter"  = "development"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "efy-web-backend-dev"
          [32m+[0m[0m "Project"     = "efy-web-backend"
          [32m+[0m[0m "Workspace"   = "dev"
        }
      [32m+[0m[0m timeout                        = 3
      [32m+[0m[0m version                        = (known after apply)
    }

[1m  # module.post_xyz_lambda.aws_iam_role.lambda_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "efy-web-backend-dev-post-xyz-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "CostCenter"  = "development"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "efy-web-backend-dev"
          [32m+[0m[0m "Project"     = "efy-web-backend"
          [32m+[0m[0m "Workspace"   = "dev"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "CostCenter"  = "development"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "efy-web-backend-dev"
          [32m+[0m[0m "Project"     = "efy-web-backend"
          [32m+[0m[0m "Workspace"   = "dev"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.post_xyz_lambda.aws_iam_role_policy_attachment.lambda_basic[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "lambda_basic" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      [32m+[0m[0m role       = "efy-web-backend-dev-post-xyz-role"
    }

[1m  # module.post_xyz_lambda.aws_lambda_function.this[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m filename                       = "./builds/efy-web-backend-dev-post-xyz.zip"
      [32m+[0m[0m function_name                  = "efy-web-backend-dev-post-xyz"
      [32m+[0m[0m handler                        = "index.handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m layers                         = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = false
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "nodejs18.x"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = "A7l/147xO7oiZKHr8fgN8Xe/iS7J3aCNuYQSH8Z4Wlw="
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "CostCenter"  = "development"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "efy-web-backend-dev"
          [32m+[0m[0m "Project"     = "efy-web-backend"
          [32m+[0m[0m "Workspace"   = "dev"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "CostCenter"  = "development"
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "efy-web-backend-dev"
          [32m+[0m[0m "Project"     = "efy-web-backend"
          [32m+[0m[0m "Workspace"   = "dev"
        }
      [32m+[0m[0m timeout                        = 3
      [32m+[0m[0m version                        = (known after apply)
    }

[1m  # module.utility_layer.aws_lambda_layer_version.this[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_layer_version" "this" {
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m code_sha256                 = (known after apply)
      [32m+[0m[0m compatible_runtimes         = [
          [32m+[0m[0m "nodejs18.x",
          [32m+[0m[0m "nodejs20.x",
        ]
      [32m+[0m[0m created_date                = (known after apply)
      [32m+[0m[0m description                 = "Shared utility functions for Lambda functions - dev"
      [32m+[0m[0m filename                    = "./builds/efy-web-backend-dev-utility-layer.zip"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m layer_arn                   = (known after apply)
      [32m+[0m[0m layer_name                  = "efy-web-backend-dev-utility-layer"
      [32m+[0m[0m signing_job_arn             = (known after apply)
      [32m+[0m[0m signing_profile_version_arn = (known after apply)
      [32m+[0m[0m skip_destroy                = false
      [32m+[0m[0m source_code_hash            = "p/YN46ir/W6ZlaXQQKbKshBfpBbPEaUhK1CaYYzhgdk="
      [32m+[0m[0m source_code_size            = (known after apply)
      [32m+[0m[0m version                     = (known after apply)
    }

[1mPlan:[0m 18 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m api_gateway_id         = (known after apply)
  [32m+[0m[0m api_gateway_url        = (known after apply)
  [32m+[0m[0m common_tags            = {
      [32m+[0m[0m CostCenter  = "development"
      [32m+[0m[0m Environment = "dev"
      [32m+[0m[0m ManagedBy   = "terraform"
      [32m+[0m[0m Name        = "efy-web-backend-dev"
      [32m+[0m[0m Project     = "efy-web-backend"
      [32m+[0m[0m Workspace   = "dev"
    }
  [32m+[0m[0m dependencies_layer_arn = (known after apply)
  [32m+[0m[0m environment            = "dev"
  [32m+[0m[0m get_xyz_lambda_arn     = (known after apply)
  [32m+[0m[0m post_xyz_lambda_arn    = (known after apply)
  [32m+[0m[0m utility_layer_arn      = (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

*This plan was generated automatically for the dev environment.*